Revit 2024 API
PaperPlacementType Enumeration
 An enumerated type listing all Paper Placement types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum PaperPlacementType
Visual Basic
Public Enumeration PaperPlacementType
Visual C++
public enum class PaperPlacementType
Members
Member name | Description
Center |  The type of Paper Placement is Center.
LowerLeft |  The type of Paper Placement is LowerLeft.
Margins |  The type of Paper Placement is Margins. It's obsolete, use LowerLeft instead.
See Also
Autodesk.Revit.DB Namespace